# Selecting a pandas Series from a DataFrame

### What is data series in pandas

* It is a m x 1 vector(one-dimensional array)
    * m is the number of rows
    * 1 is the number of columns
* Each column in DataFrame is known as a pandas series

In [1]:
import pandas as pd

In [6]:
# It is a comma-separated values(CSV) file
url = 'http://bit.ly/uforeports'

In [7]:
# method 1: read_table()
#read_table use tab\t as the default separator,
ufo = pd.read_table(url, sep=',')

In [9]:
# method 2: read_csv()
# read_csv(),read_csv() uses comma  as the default separator.
# read_table is read_csv with sep=',' replaced by sep='\t' 
ufo = pd.read_csv(url)
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
# Method1 :Selecing City series( this method1 always works)

In [11]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [14]:
# Method2 :Selecing City series
# #'City' is case-sensitive, we cannot use 'city' instead

In [13]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [15]:
# Confirm type

In [16]:
type(ufo['City'])

pandas.core.series.Series

In [17]:
type(ufo.City)

pandas.core.series.Series

### How to select a column name with spacing between words( catefory_name)?

* we can not use the method 2 df.column_name   ( ufo.category_name)
* we can do it with method 1 df['Column_ Name']  (ufo['category_name'])

In [19]:
ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

### How to create a new pandas Series in a DataFrame?

In [22]:
# simple example  of String Concatenation Using + operator
'ab' +'cd'

'abcd'

In [23]:
# created a new column called "Location" with a concatenation of "City" and "State"
ufo['Location'] = ufo.City + ',' + ufo.State

In [24]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

### Reference

[Python String Concatenation](https://www.w3schools.com/python/gloss_python_string_concatenation.asp)

[pandas.Series Documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.html)